<template>
  <div class="tip">
    <PersonalHeader text="技术要求" />
    <div class="tip-content">
      <h5>1. 技术要求: </h5>
      <p>• 图片尺寸 ≥600万像素</p>
      <p>• 图片格式 JPG</p>
      <h5>2. 文字要求</h5>
      <p>• 作品的标题与关键词至关重要！正确、有效的标题与关键词，有助于提高大家作品的售卖机会。</p>
      <p>• 我们建议，标题为：简单描述拍摄内容的一句话，包含必要准确的信息。尽量不要使用默认文件名或数字信息等内容，如jingdu123.jpg、广州风光01、广州风光02</p>
      <p>• 每张作品，可多输入一些关键词，这些文字尽量能客观、准确的描述作品中的主要信息。 划重点！！！</p>
      <p>• 不可忽视的“地点”信息 大家在上传风机、火电、光伏，以及有区域特点的作品时，“地点”信息一定要填写准确，这点对争取更好的销售机会尤为重要！</p>
      <h5>3. 内容要求</h5>
      <p>• 通常每一个作品都会被放大到100%的状态，来判断细节。标准的拍摄，通常包括明确的主题、准确的曝光、清晰的角度以及正常的色调等因素。当拍摄局部特写或动态画面时，仍需要注意作品中有明确且能清晰可识别的焦点。同时，无论是户外或是室内影棚拍摄，也需要保证正确的曝光和白平衡，以确定画面的色调不会偏色等等，这些都是评判作品的基本标准。</p>
      <p>• 后期“修图”需要注意的问题</p>
      <p>大家需要注意，避免多度后期，导致对比度过大、噪点、锐化、精度不佳等问题，会影响作品的整体画质。</p>
      <p>• 后期“合成”需要注意的问题</p>
      <p>后期合成时不要过于生硬，包括谨慎使用特色滤镜，少“踩坑”，避免出现不恰当的效果。关于logo、水印、文字信息、边框的建议</p>
      <p>大家在日常分享中，会添加个人水印、logo或是文字等内容，在投稿给图库时需要去掉这些信息，上传单纯的作品，更有利于售卖。</p>
      <p>• 必要的筛图</p>
      <p>提供差异化的内容、避免过多相似图片提交。</p>
    </div>
  </div>
</template>

<script>
/**
 * 个人中心-提示(技术要求)模块
 * @author lyh
 * @date 2021-01-12
 */
import PersonalHeader from '@/components/PersonalHeader/index'
export default {
  name: 'Notice',
  components: { PersonalHeader }
}
</script>

<style scoped>

</style>
