<template>
  <el-dialog class="regist-dialog" :visible.sync="dialogVisible" width="812px" title="能源图库用户注册协议">
    <div class="pb-32">
      <h2>在您成为能源图库（简称“图库”）实名注册用户（简称“注册用户”）之前，请确认您已充分阅读、理解并接受本协议的全部内容，同意遵循本协议的所有约定。如您不同意本服务协议及或随时对其的补充和修改，您可以主动停止使用能源图库提供的服务；您一旦使用，即视为您已了解并完全同意本服务协议各项内容，包括能源图库对本协议随时所做的任何补充和修改。</h2>
      <p>1.【协议适用主体范围】能源图库的运营管理权归北京角马能源科技有限公司所有。订立本协议的用户，应当是具备完全民事权利能力和完全民事行为能力的自然人。</p>
      <p>2.【服务内容】注册用户在能源图库可使用相关图库功能、储存个人信息资料，并自行维护用户信息。</p>
      <p>3.【注册信息提供及账号管理】注册用户的账号所有权归属北京角马能源科技有限公司，用户在注册账号时，应当按注册页面引导提供真实、准确、最新和完整的个人资料，使用本人手机号码等个人信息进行实名验证。用户阅读并同意本协议且完成全部注册程序后，即可获得能源图库账号并成为能源图库用户，请按以下规则管理账号： </p>
      <p>（1）不得以虚假信息或其他违法和不良信息进行注册。</p>
      <p>（2）不得将账号、密码转让或出借予他人使用。</p>
      <p>（3）若违反相关法律法规和本协议各项规定，能源图库有权对该用户账号单方采取暂停使用等措施。</p>
      <p>（4）若服务被终止或取消，能源图库可以从服务器上永久地删除该用户的数据；服务终止或取消后，能源图库没有义务向用户返还或恢复任何数据。</p>
      <p>4.【用户承诺和授权】注册用户在使用能源图库账号时承诺并确认：</p>
      <p>（1）遵守中国法律和法规，遵守所有与网络服务有关的网络协议、规定和程序。</p>
      <p>（2）不得利用能源图库进行任何可能对互联网的正常运转造成不利影响的行为。</p>
      <p>（3）不得利用能源图库进行任何不利于能源图库的行为。</p>
      <p>（4）用户应当对其所提供内容的真实性、合法性负责，不得出现违法和不良信息。</p>
      <p>（5）用户同意接收能源图库推送的信息。</p>
      <p>（6）用户上传到能源图库的除个人信息以外的图片内容，能源图库具有免费使用权。</p>
      <p>5.【隐私保护】能源图库依法保护个人隐私，不得违法违规向第三方提供用户注册资料，但下列情况除外： </p>
      <p>（1）事先获得用户的明确授权；</p>
      <p>（2）根据有关的法律法规要求；</p>
      <p>（3）按照相关政府主管部门的要求；</p>
      <p>（4）为维护社会公众的利益；</p>
      <p>（5）为维护能源图库的合法权益；</p>
      <p>（6）符合其它相关要求。</p>
      <p>6.【禁止条款】注册用户有违反法律法规行为的，能源图库有权终止为用户提供服务，并保留追责的权利。</p>
      <p>7.【注意事项】能源图库将加强网络安全管理和风险防控，因技术原因和网络中断等因素，可能会造成注册用户的实时操作无效或暂停，请注意备份相关资料。</p>
      <p>8.【免责声明】注册用户同意发生下列情形时，能源图库将不承担任何责任，包括但不限于： </p>
      <p>（1）因能源图库不定期对提供网络服务的平台或相关的设备进行检修或者维护而导致的服务中断。</p>
      <p>（2）因不可抗力、黑客攻击、病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因、第三方服务瑕疵等原因而导致的用户信息泄漏、服务中断及其他损失。</p>
      <p>（3）因注册用户所发布的言论或内容涉嫌构成违法和不良信息，能源图库有权不经通知单方面采取删除、屏蔽或断开连接等措施。</p>
      <p>（4）注册用户使用能源图库服务过程中导致能源图库或任何其他第三方产生损失的，用户应当承担全部责任。 </p>
      <p>（5）注册用户使用能源图库网络服务而产生的任何其他后果。</p>
    </div>
  </el-dialog>
</template>

<script>
/**
 * 登录-注册(注册协议)模块
 * @author lyh
 * @date 2020-12-06
 */
export default {
  name: 'RegistrationDialog',
  data() {
    return {
      dialogVisible: false
    }
  }
}
</script>

<style scoped lang="scss">
.regist-dialog {
  width: 100%;
  height: 100%;
  /deep/ {
    .el-dialog {
      border-radius: unset;
    }
    .el-dialog__header {
      border-bottom: unset;
      text-align: center;
      padding-top: 30px;
      .el-dialog__title{
        font-size: 20px;
        margin-bottom: 16px;
        font-weight: bold;
      }
    }
    .el-dialog__body {
      height: 568px;
      overflow-y: auto;
    }
  }
  h2 {
    font-weight: 400;
    margin-bottom: 4px;
  }
  p {
    margin-bottom: 8px;
  }
}
</style>
