<template>
  <el-dialog class="service-dialog" :visible.sync="dialogVisible" width="812px" title="能源图库用户服务条款">
    <div class="pb-32">
      <h1>第一章 概述</h1>
      <h2>第一条</h2>
      <p>
        为促进开放、透明、分享、责任的新商业文明，保障能源图库网站用户的合法权益，创建、维护和谐的网络商业环境，制订本协议。
      </p>
      <h2>第二条</h2>
      <p>
        1、本规则适用于使用或提供能源图库网站任何产品或服务（以下统称“服务”）的用户。
      </p>
      <p>2、用户在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。</p>
      <h2>第三条</h2>
      <p>1、用户在适用本协议条款上一律平等。</p>
      <p>2、当用户按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示用户已充分阅读、理解并接受本协议的全部内容，并于能源图库达成一致，成为能源图库的用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款的约定，用户应立即停止注册程序。</p>
      <h2>第四条</h2>
      <p>
        用户应遵守国家法律、行政法规、部门规章等规范性文件以及与能源图库签署的协议、能源图库服务条款、网站规则。同时，由于互联网高速发展，用户与能源图库签署的本协议列明的条款并不能完整罗列并覆盖用户与能源图库所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，能源图库的相关证明、政策、制度均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如用户使用能源图库服务，视为已同意上述补充协议。
      </p>
      <h2>第五条</h2>
      <p>
        若本协议的规定同用户与能源图库签署的协议的约定相冲突，则优先适用双方协议的约定。双方协议中未约定的，则适用本协议。本协议尚无规定的，能源图库有权酌情处理，但能源图库对用户的处理不能免除用户应尽的法律责任。
      </p>
      <h2>第六条</h2>
      <p>
        能源图库有权视需要对本协议做修订，对本协议的修订自在能源图库网站上发布之日起生效。
      </p>
      <h1>第二章 定义</h1>
      <h2>第七条</h2>
      <p>能源图库：指能源图库网站。</p>
      <h2>第八条</h2>
      <p>用户：指能源图库各项服务的使用者。</p>
      <h2>第九条</h2>
      <p>
        会员：指与能源图库签订《能源图库服务条款》并完成注册流程的用户。每个帐号对应唯一的会员名。
      </p>
      <h2>第十条</h2>
      <p>采购商：指在能源图库上浏览或购买产品或发布询价单的用户。</p>
      <h2>第十一条</h2>
      <p>
        供应商：指在能源图库上发布供应产品信息、企业信息或发布报价单的会员。
      </p>
      <h2>第十二条</h2>
      <p>投诉方：指发起投诉的符合相关法律规定的自然人、法人、其他经济组织。</p>
      <h2>第十三条</h2>
      <p>被投诉方：指投诉方所投诉的能源图库网站用户。</p>
      <h2>第十四条</h2>
      <p>
        反通知：被投诉方接到投诉方的投诉通知后向能源图库提交的通知及相关证明材料。
      </p>
      <h2>第十五条</h2>
      <p>
        处罚：指用户因自身违规行为而被处理，具体种类包括：警告、下架、删除、降权、帐号限权、帐号关闭等。
      </p>
      <p>
        警告：指能源图库通过电话、短信、邮件等形式提醒、告诫用户其行为已经构成了违规，应当及时予以改正，如仍进行或不停止违规行为，将给予更为严厉的处理。
      </p>
      <p>
        下架：指能源图库针对违规信息将进行信息下架，信息下架后用户仍可进行修改，修改正确后，信息方可正常发布。
      </p>
      <p>
        删除：指能源图库针对违规信息做删除的处理，信息删除后用户不可修改。
      </p>
      <p>降权：指用户发布的产品信息排序被置后。</p>
      <p>
        帐号限权：指能源图库暂停用户包括但不限于以下权限：暂停用户的访问权限、对已发布的所有信息执行下架或删除处理（如有）、暂停供应产品信息或采购单、报价单的操作权限等。
      </p>
      <p>
        被限权用户在限权期限内服务费用（包括但不限于保证金、服务费等，如有）照常计算，服务期限不予延长。
      </p>
      <p>
        帐号关闭：能源图库终止向用户提供任何服务，并不予退返服务费（如有）。
      </p>
      <h1>第三章 用户行为规则</h1>
      <h3>第一节 注册 帐号注册</h3>
      <h2>第十六条</h2>
      <p>1、用户确认并承诺，在开始注册程序使用能源图库服务前，已具备中华人民共和国法律规定的与用户行为相适应的民事行为能力。若用户不具备前述与其行为相适应的民事行为能力，则用户及用户的监护人应依照法律规定承担因此而导致的一切后果。</p>
      <p>
        2、用户会员名（ID，也称会员帐号或帐号）、头像和简介等注册信息及其他个人信息中不得包含违反国家法律法规、涉嫌侵犯他人权利或干扰能源图库正常运营秩序等的相关信息；
      </p>
      <p>
        3、能源图库有权对用户提交的注册信息进行审核。同一个会员名只能注册一个帐号，并且验证该帐号有效的手机号或邮箱未用于其它帐号的验证，会员名注册后无法自行修改（能源图库审核同意的除外）。
      </p>
      <p>4、如有证据证明或根据能源图库规则判断用户存在不当注册或不当使用多个账户的情形，能源图库可采取账号限权、账号关闭等措施，如给能源图库造成损失的，用户还应承担赔偿责任。</p>
      <h2>第十七条</h2>
      <p>
        1、在注册、使用和管理账号时，用户应保证注册账号时填写的身份信息的真实性，用户注册时必须提供真实、准确、合法、有效的相关身份证明材料及必要的信息、[已经三证合一了、]并进行法人资格认证后才能使用能源图库网站提供的服务，否则能源图库有权拒绝为用户提供相关服务，或在使用过程中部分功能受到限制
      </p>
      <p>2、用户理解并同意，出于安全性和身份之别的考虑，用户可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
      <h2>第十八条 帐号管理</h2>
      <p>
        1、用户在能源图库的注册账号仅限于用户本人使用，未经能源图库书面审核同意，禁止以任何形式赠与、借用、出租、转让、售卖或以其他方式许可他人或其他企业使用该账号；如果能源图库发现或有合理理由认为使用者并非账号初始注册人，为保障账号安全，能源图库有权立即暂停或关闭向该账户提供服务，并有权永久禁用该账号。因擅自许可他方使用时，转让方须承担该帐号下所有行为的法律责任。
      </p>
      <p>2、用户有责任维护自身账号、密码的安全性与保密性，并对您注册账号名义所从事的活动承担全部法律责任，包括但不限于用户在能源图库软件及相关服务上进行的任何数据修改、作品发表、言论发表、款项支付（如有）等操作行为可能引起的一切法律责任。用户应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。若发现他人未经许可使用本人的账号或者发生其他安全漏洞问题时，用户应当立即通知能源图库。</p>
      <p>3、用户可以申请注销账号，能源图库在完成身份核实、安全状态、设备信息、侵权投诉等方面的合理和必要的验证后协助用户注销账号，并依照用户的要求删除相关账号的一切信息，法律法规另有规定的除外。</p>
      <h2>第十九条</h2>
      <p>
        1、用户理解并同意，为了充分使用账号自愿，能源图库有权无偿回收未通过身份认证或虽通过身份认证但连续超过一年未登录的会员帐号。如账号被回收，用户将无法通过此前持有的账号登录并使用能源图库软件及相关服务，用户在还账号下保存的任何个性化设置和使用记录将无法恢复。在回收账号前，能源图库将以适当方式向用户做出提示，如用户在收到相关提示后一周内仍未登录、使用账号，能源图库将进行账号回收。如账号被回收，用户仍可通过注册新的账号登录、使用能源图库软件及相关服务。
      </p>
      <p>
        2、用户同意，能源图库有权使用用户的注册信息、用户名、密码等信息，登录计入用户的注册账户，进行证据保全，包括但不限于公证、见证等。
      </p>
      <h2>第二节 经营 信息发布/管理</h2>
      <h2>第二十条</h2>
      <p>
        1、用户在能源图库网站制作、发布、传播的信息应遵循合法、真实、准确、有效、完整的基本原则 ，对自己发布的信息及使用能源图库软件和相关服务独立承担全部责任，若用户未遵守以下规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施：
      </p>
      <p>（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的信息，煽动颠覆国家政权、推翻社会主义制度的信息，煽动分裂国家、破坏国家统一的的信息，煽动民族仇恨、民族歧视、破坏民族团结的信息；</p>
      <p>（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</p>
      <p>（3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
      <p>（4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；</p>
      <p>（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</p>
      <p>（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
      <p>（7）不得教唆他人从事本条所禁止的行为；</p>
      <p>（8）不得利用在本站注册的账户进行牟利性经营活动；</p>
      <p>（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</p>
      <p>（10）不得从事其他违反国家法律法规、侵犯他人合法权益或干扰能源图库网站运营秩序的活动。</p>
      <p>2、用户具体使用及授权方式详见《授权许可协议》。</p>
      <p>《授权许可协议》。
        3、本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。</p>
      <h2>第二十一条 订单</h2>
      <p>
        1、用户下订单时，请仔细确认所交易商品/服务的名称、价格、说明、注意事项等信息并确认已仔细阅读本协议。
      </p>
      <p>2、当交易双方（即采购商和供应商）选择并确认使用能源图库支付服务后，将视为接受由能源图库提供的各类支付服务，同意接受并遵守能源图库自行执行的相关收费标注和规定。</p>
      <h2>第二十二条 退货退款</h2>
      <p>1、采购商在订单支付之前可以取消订单，一旦支付，订单不可取消。能源图库将不提供任何订单更改、修正服务。未经能源图库同意，采购商在能源图库购买的收费服务不会因能源图库提供的服务中止、中断或付费商品下架而退还。</p>
      <p>2、因如下情况造成订单延迟或无法交付等，能源图库不承担任何责任：</p>
      <p>(1)用户提供的信息错误、地址不详细等原因导致的；</p>
      <p>(2)产品交付后无人查阅、签收，导致无法交付或延迟交付的；</p>
      <p>(3)情势变更因素导致的</p>
      <p>(4)不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。</p>
      <h2>第三节 维权（交易争议）</h2>
      <h2>第二十三条</h2>
      <p>
        供应商和采购商双方就交易在履行过程中产生争议，争议双方应先行自主协商；如双方无法协商或协商不能达成一致的，一方或双方可申请提交能源图库进行协调处理，能源图库有权决定受理或不受理相关争议，并对相关事实进行认定及对用户的违规行为进行处罚。如用户对协调处理决定不满意，仍有权采取其他争议处理途径解决争议，但通过其他争议处理途径未取得终局决定前，用户仍应先行履行协调处理决定。
      </p>
      <h1>第四章 违规行为及处理</h1>
      <h2>第一节 违规行为定义</h2>
      <h2>第二十四条</h2>
      <p>
        违规行为是指用户违反能源图库的网站规则或其与能源图库签订的任何合同的行为。
      </p>
      <h2>第二节 违规行为 违禁信息发布</h2>
      <h2>第二十五条</h2>
      <p>
        指用户发布国家法律法规或能源图库网站禁止或限制的商品信息行为。用户发布的商品信息一经认定属于禁止、限制销售商品信息，能源图库将立即删除该商品信息，同时根据情节轻重对用户予以警告、帐号限权直至帐号关闭等处罚。
      </p>
      <h2>第二十六条 违规供应产品信息发布</h2>
      <p>
        指用户在能源图库网站涉嫌以下几种供应产品信息违规发布行为：使用恶意外部软件违规、标题描述违规、属性不实、类目放置错误、无货空挂、虚假价格违规等；用户发布的供应产品商品信息一经认定属于违规信息，能源图库将根据情节轻重对用户予以产品信息下架、信息删除、帐号限权等处罚。
      </p>
      <h2>第二十七条 供应产品重复信息发布</h2>
      <p>
        指用户在能源图库网站发布的供应产品信息与此前已发布上线的信息完全相同或产品重要属性、描述（包括品牌、规格型号、图片信息等）相同；用户发布的供应产品信息一经认定属于重复信息，能源图库将根据情节轻重对用户予以产品信息降权、信息删除、帐号限权等处罚。
      </p>
      <h2>第二十八条 询价单违规发布</h2>
      <p>
        指用户在能源图库网站涉嫌以下几种询价单违规发布行为：询价单内容违反能源图库运营秩序、询价产品属于禁限售产品、询价单名为询价,实为广告、重复询价等；用户发布的询价单一经认定属于违规信息，能源图库将根据情节轻重对用户予以信息删除、帐号限权等处罚。
      </p>
      <h2>第二十九条 报价单违规发布</h2>
      <p>
        指用户在能源图库网站涉嫌以下几种报价单违规发布行为：报价单内容违反能源图库运营秩序、报价内容与询价单无关、报价单价格不实、报价单内容涉及禁限售产品信息等；用户发布的报价单一经认定属于违规信息，能源图库将根据情节轻重对用户予以信息删除、帐号限权等处罚。
      </p>
      <h2>第三十条 所有权及知识产权条款</h2>
      <p>1、供应商用户一旦接受本协议，即表明该用户主动将其在任何时间段在能源图库发表的任何形式的信息内容的财产性权利等可转让的权利，如著作权财产权（包括但不限于：复制权、发行权、出租权等以及应当由著作权人现有的其他可转让权利），全部独家且不可撤销地转让给能源图库所有，供应商用户同意能源图库有权就任何主体侵权而单独提起诉讼。</p>
      <p>2、本协议已经构成中华人民共和国相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在能源图库上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是订立后。</p>
      <p>3、供应商用户同意并已充分了解本协议的条款，承诺不将已发表于本站的信息，以任何形式发布或授权其他主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。</p>
      <p>4、能源图库是本平台的制作者，拥有此网站内容及资源、信息的著作权等合法权利，受国家法律保护，有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的限度范围内，能源图库对本协议及本站内容拥有解释权。</p>
      <p>5、除法律另有强制性规定外，未经能源图库明确的特别书面许可，任何单位或个人不得以任何非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，能源图库有权追究其法律责任。</p>
      <p>6、如供应商用户在能源图库网站发布的信息侵犯他人知识产权等权利，能源图库一旦收到相关侵权投诉，供应商应及时提交反通知及证明材料，说明产品合法性，用户应保证提供的反通知资料真实、合法、有效，若未及时提交反通知，或提交的反通知不成立，能源图库将根据情节轻重对用户予以信息删除、帐号限权直至帐号关闭等处罚。</p>
      <h2>第三节 违规行为处理的执行</h2>
      <h2>第三十一条</h2>
      <p>能源图库如有理由认为用户的行为违反或可能违反本协议及能源图库其他协议的行为，能源图库可独立进行判断并对用户予以违规扣分及处罚；同时每个自然月能源图库将对供应商进行综合累计考评，并视考评结果对达到考评处罚标准的用户予以相应处罚。情节严重者，能源图库将视情节采取如预先警示、拒绝发布、立即停止传输信息、删除内容等相关处罚。</p>
      <p>能源图库尊重并保护用户及他人的知识产权、名誉权、姓名权、隐私权等合法权益。用户徐宝珍，在使用能源土路及相关服务是上传的文字、图片、链接等不侵犯任何第三发合法权益。否则，能源图库有权在收到权利方或者相关方通知的情况下独立决定移除涉嫌侵权内容。</p>
      <p>
        因用户行为引起第三方投诉或诉讼索赔的，用户应当自行处理并承担可能因此产生的全部法律责任。因用户的违法或违约等行为导致能源图库及关联方向任何第三方赔偿或遭受国家机关处罚的，用户应足额赔偿能源图库及关联方因此遭受的全部损失。
      </p>
      <h2>第四节 违规行为处理的申诉</h2>
      <h2>第三十二条</h2>
      <p>
        对发布限制产品信息类违规及知识产权侵权类违规行为处理的申诉，被投诉人须在被投诉之日起3个工作日内提交相关证明材料。逾期未提交证明材料或提交证明材料不充分的，能源图库有权根据当时所掌握的情况进行判断与处理。
      </p>
      <h2>第五节 其他</h2>
      <p>1、本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。</p>
      <p>2、如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向能源图库所在地的中华人民共和国大陆地区法院提起诉讼。</p>
      <p>3、能源图库所有者是指在政府部门依法许可或备案的能源图库网站、平台、APP经营主体。</p>
    </div>
  </el-dialog>
</template>

<script>
/**
 * 登录-注册(服务条款)模块
 * @author lyh
 * @date 2020-12-06
 */
export default {
  name: 'ServiceDialog',
  data() {
    return {
      dialogVisible: false
    }
  }
}
</script>

<style scoped lang="scss">
.service-dialog {
  width: 100%;
  height: 100%;
  /deep/ {
    .el-dialog {
      border-radius: unset;
    }
    .el-dialog__header {
      border-bottom: unset;
      text-align: center;
      padding-top: 30px;
      .el-dialog__title{
        font-size: 20px;
        margin-bottom: 16px;
        font-weight: bold;
      }
    }
    .el-dialog__body {
      //padding-top: 36px;
      height: 568px;
      overflow-y: auto;
    }
  }
  .s-d-title {
    font-size: 18px;
    margin-bottom: 16px;
    font-weight: bold;
  }
  h1 {
    font-weight: bold;
    font-size: 16px;
    margin-bottom: 4px;
  }
  h2 {
    font-weight: 400;
    margin-bottom: 4px;
  }
  p {
    margin-bottom: 8px;
  }
}
</style>
