<template>
  <el-dialog class="service-dialog" :visible.sync="dialogVisible" width="812px" title="能源图库用户服务条款">
    <div class="pb-32">
      <h1>第一章 概述</h1>
      <h2>第一条</h2>
      <p>
        为促进开放、透明、分享、责任的新商业文明，保障能源图库网站用户的合法权益，创建、维护和谐的网络商业环境，制订本规则。
      </p>
      <h2>第二条</h2>
      <p>
        本规则适用于使用能源图库网站任何产品或服务（以下统称“服务”）的用户。
      </p>
      <h2>第三条</h2>
      <p>用户在适用规则上一律平等。</p>
      <h2>第四条</h2>
      <p>
        用户应遵守国家法律、行政法规、部门规章等规范性文件以及与能源图库签署的协议、能源图库服务条款、网站规则。
      </p>
      <h2>第五条</h2>
      <p>
        若本规则的规定同用户与能源图库签署的协议的约定相冲突，则优先适用双方协议的约定。协议中未约定的，则适用本规则。本规则尚无规定的，能源图库有权酌情处理，但能源图库对用户的处理不能免除用户应尽的法律责任。
      </p>
      <h2>第六条</h2>
      <p>
        能源图库有权视需要对本规则做修订，对本规则的修订在能源图库网站上公告后生效。
      </p>
      <h1>第二章 定义</h1>
      <h2>第七条</h2>
      <p>能源图库：指能源图库网站。</p>
      <h2>第八条</h2>
      <p>用户：指能源图库各项服务的使用者。</p>
      <h2>第九条</h2>
      <p>
        会员：指与能源图库签订《能源图库服务条款》并完成注册流程的用户。每个帐号对应唯一的会员名。
      </p>
      <h2>第十条</h2>
      <p>零售商：指在能源图库上浏览或购买产品或发布询价单的用户。</p>
      <h2>第十一条</h2>
      <p>
        供应商：指在能源图库上发布供应产品信息、企业信息或发布报价单的会员。
      </p>
      <h2>第十二条</h2>
      <p>投诉方：指发起投诉的符合相关法律规定的自然人、法人、其他经济组织。</p>
      <h2>第十三条</h2>
      <p>被投诉方：指投诉方所投诉的能源图库网站用户。</p>
      <h2>第十四条</h2>
      <p>
        反通知：被投诉方接到投诉方的投诉通知后向能源图库提交的通知及相关证明材料。
      </p>
      <h2>第十五条</h2>
      <p>
        处罚：指用户因自身违规行为而被处理，具体种类包括：警告、下架、删除、降权、帐号限权、帐号关闭等。
      </p>
      <p>
        警告：指能源图库通过电话、短信、邮件等形式提醒、告诫用户其行为已经构成了违规，应当及时予以改正，如仍进行或不停止违规行为，将给予更为严厉的处理。
      </p>
      <p>
        下架：指能源图库针对违规信息将进行信息下架，信息下架后用户仍可进行修改，修改正确后，信息方可正常发布。
      </p>
      <p>
        删除：指能源图库针对违规信息做删除的处理，信息删除后用户不可修改。
      </p>
      <p>降权：指用户发布的产品信息排序被置后。</p>
      <p>
        帐号限权：指能源图库暂停用户包括但不限于以下权限：暂停用户的访问权限、对已发布的所有信息执行下架或删除处理（如有）、暂停供应产品信息或采购单、报价单的操作权限等。
      </p>
      <p>
        被限权用户在限权期限内服务费用（包括但不限于保证金、服务费等，如有）照常计算，服务期限不予延长。
      </p>
      <p>
        帐号关闭：能源图库终止向用户提供任何服务，并不予退返服务费（如有）。
      </p>
      <h1>第三章 用户行为规则</h1>
      <h3>第一节 注册 帐号注册</h3>
      <h2>第十六条</h2>
      <p>用户在能源图库注册帐号时需同意并遵守《能源图库服务条款》；</p>
      <p>
        用户会员名（ID，也称会员帐号或帐号）中不得包含违反国家法律法规、涉嫌侵犯他人权利或干扰能源图库正常运营秩序等的相关信息；
      </p>
      <p>
        同一个会员名只能注册一个帐号，并且验证该帐号有效的手机号或邮箱未用于其它帐号的验证，会员名注册后无法自行修改
        （能源图库审核同意的除外）。
      </p>
      <h2>第十七条</h2>
      <p>
        用户注册后必须提供公司营业执照、税务登记证、组织机构代码证并进行法人资格认证后才能使用能源图库网站提供的服务。
      </p>
      <h2>帐号管理 第十八条</h2>
      <p>
        禁止会员帐号未经能源图库审核同意随意转让他人或其他企业使用；随意转让会员帐号的将被关闭，且转让方还须承担该帐号下所有行为的法律责任。
      </p>
      <h2>第十九条</h2>
      <p>
        能源图库有权回收未通过身份认证或虽通过身份认证但连续超过一年未登录的会员帐号；
      </p>
      <p>
        能源图库有权关闭涉嫌欺诈等重度违规行为的会员帐号，并有权删除该帐号下所有相关信息；会员可通过能源图库网站客服主动申请关闭其帐号。
      </p>
      <h2>第二节 经营 信息发布/管理</h2>
      <h2>第二十条</h2>
      <p>
        用户在能源图库网站发布信息应遵循合法、真实、准确、有效、完整的基本原则
        ，对自己发布的信息独立承担全部责任；不得包含违反国家法律法规、涉嫌侵犯他人合法权益或干扰能源图库网站运营秩序等相关内容。
      </p>

      <h2>支付 第二十一条</h2>
      <p>
        当交易双方选择并确认使用能源图库支付服务后，将视为接受由能源图库提供的各类支付服务，并遵守能源图库有关规定。
      </p>
      <h2>退货退款 第二十四条</h2>
      <p>零售商在订单支付之前可以取消订单，一旦支付，订单不可取消。</p>
      <h2>第二十五条</h2>
      <p>零售商在确认收货之前可以申请退货退款，退货必须征得供应商同意。</p>
      <h2>第二十六条</h2>
      <p>零售商申请退货退款后，依以下情况分别处理：</p>
      <p>
        （一）自零售商申请退货退款之时起7天内供应商未做处理的，能源图库视为供应商同意零售商的退货退款申请，并退款给零售商。
      </p>
      <p>
        （二）供应商拒绝退款申请后，零售商不能再次修改退款申请，交易正常进行，能源图库将打款给供应商。
      </p>
      <p>
        （三）供应商同意零售商退货，零售商必须在15天内将商品退货给供应商，否则退款申请关闭，交易正常进行，能源图库将打款给供应商；供应商在零售商点击退货后的15天内未确认收货且未做任何操作，能源图库视为供应商已经收到零售商的退货并退款给零售商。
      </p>
      <h2>第三节 维权（交易争议） 第二十七条</h2>
      <p>
        供应商和零售商双方就交易在履行过程中产生争议，如双方无法协商或协商不能达成一致的，一方或双方可申请提交能源图库进行斡旋处理，能源图库有权决定受理或不受理相关争议，并对相关事实进行认定及对用户的违规行为进行处罚。
      </p>
      <h1>第四章 违规行为及处理</h1>
      <h2>第一节 违规行为定义</h2>
      <h2>第二十八条</h2>
      <p>
        违规行为是指用户违反能源图库的网站规则或其与能源图库签订的任何合同的行为。
      </p>
      <h2>第二节 违规行为 违禁信息发布 第二十九条</h2>
      <p>
        指用户发布国家法律法规或能源图库网站禁止或限制的商品信息行为。用户发布的商品信息一经认定属于禁止、限制销售商品信息，能源图库将立即删除该商品信息，同时根据情节轻重对用户予以警告、帐号限权直至帐号关闭等处罚。
        违规供应产品信息发布
      </p>
      <h2>第三十条</h2>
      <p>
        指用户在能源图库网站涉嫌以下几种供应产品信息违规发布行为：使用恶意外部软件违规、标题描述违规、属性不实、类目放置错误、无货空挂、虚假价格违规等；用户发布的供应产品商品信息一经认定属于违规信息，能源图库将根据情节轻重对用户予以产品信息下架、信息删除、帐号限权等处罚。
        供应产品重复信息发布
      </p>
      <h2>第三十一条</h2>
      <p>
        指用户在能源图库网站发布的供应产品信息与此前已发布上线的信息完全相同或产品重要属性、描述（包括品牌、规格型号、图片信息等）相同；用户发布的供应产品信息一经认定属于重复信息，能源图库将根据情节轻重对用户予以产品信息降权、信息删除、帐号限权等处罚。
      </p>
      <h2>询价单违规发布 第三十二条</h2>
      <p>
        指用户在能源图库网站涉嫌以下几种询价单违规发布行为：询价单内容违反能源图库运营秩序、询价产品属于禁限售产品、询价单名为询价,实为广告、重复询价等；用户发布的询价单一经认定属于违规信息，能源图库将根据情节轻重对用户予以信息删除、帐号限权等处罚。
      </p>
      <h2>报价单违规发布 第三十三条</h2>
      <p>
        指用户在能源图库网站涉嫌以下几种报价单违规发布行为：报价单内容违反能源图库运营秩序、报价内容与询价单无关、报价单价格不实、报价单内容涉及禁限售产品信息等；用户发布的报价单一经认定属于违规信息，能源图库将根据情节轻重对用户予以信息删除、帐号限权等处罚。
      </p>
      <h2>知识产权侵权 第三十四条</h2>
      <p>
        指用户在能源图库网站发布的信息侵犯他人知识产权等权利。用户发布的信息一旦收到相关侵权投诉，应及时提交反通知及证明材料，说明产品合法性，用户应保证提供的反通知资料真实、合法、有效，若未及时提交反通知，或提交的反通知不成立，能源图库将根据情节轻重对用户予以信息删除、帐号限权直至帐号关闭等处罚。
      </p>
      <h2>第三节 违规行为处理的执行</h2>
      <h2>第三十五条</h2>
      <p>
        用户有违规行为的，能源图库有权对用户予以违规扣分及处罚；同时每个自然月能源图库将对供应商进行综合累计考评，并视考评结果对达到考评处罚标准的用户予以相应处罚。
      </p>
      <h2>第四节 违规行为处理的申诉</h2>
      <h2>第三十六条</h2>
      <p>
        对发布限制产品信息类违规及知识产权侵权类违规行为处理的申诉，被投诉人须在被投诉之日起3个工作日内提交相关证明材料。逾期未提交证明材料或提交证明材料不充分的，能源图库有权根据当时所掌握的情况进行判断与处理。
      </p>
    </div>
  </el-dialog>
</template>

<script>
/**
 * 登录-注册(服务条款)模块
 * @author lyh
 * @date 2020-12-06
 */
export default {
  name: 'ServiceDialog',
  data() {
    return {
      dialogVisible: false
    }
  }
}
</script>

<style scoped lang="scss">
.service-dialog {
  width: 100%;
  height: 100%;
  /deep/ {
    .el-dialog {
      border-radius: unset;
    }
    .el-dialog__header {
      border-bottom: unset;
      text-align: center;
      padding-top: 30px;
      .el-dialog__title{
        font-size: 20px;
        margin-bottom: 16px;
        font-weight: bold;
      }
    }
    .el-dialog__body {
      //padding-top: 36px;
      height: 568px;
      overflow-y: auto;
    }
  }
  .s-d-title {
    font-size: 18px;
    margin-bottom: 16px;
    font-weight: bold;
  }
  h1 {
    font-weight: bold;
    font-size: 16px;
    margin-bottom: 4px;
  }
  h2 {
    font-weight: 400;
    margin-bottom: 4px;
  }
  p {
    margin-bottom: 8px;
  }
}
</style>
