<template>
  <div class="authorize">
    <h3>授权协议</h3>
    <p>能源图库和被授权人签订的授权许可协议，对被授权人使用能源图库的图片、插图、矢量图等产品（以下单独和统称为“内容”）的方式作出规定。在被授权人成为能源图库（简称“图库”）实名注册用户（简称“注册用户”）之前，请确认已充分阅读、理解并接受本协议的全部内容，同意遵循本协议的所有约定。如被授权人不同意本服务协议及或随时对其的补充和修改，可以主动停止使用能源图库提供的服务；如果被授权人使用能源图库提供的内容，视为被授权人接受本协议的条款。包括能源图库对本协议随时所做的任何补充和修改。 </p>
    <p>1.【授权内容】</p>
    <p>永久性：被授权人使用内容的权利不存在到期日或终止日；世界范围：可以在任何区域使用内容；无限次：可以无限次使用内容；任何及所有媒体：可以在平面、数字或任何其他媒体或格式中使用内容；非排他性：被授权人不享有排他性使用内容的权利。能源图库可以将相同内容授权给其他客户使用。如果被授权人希望获得使用非特定使用范围内容的排他性权利，请联系能源图库买断事宜。</p>
    <p>在本协议中，“使用”指拷贝、复制、修改、编辑、发布或以其他形式使用。请务必阅读“限制性使用”部分的除外情形。</p>
    <p>2.【限制性使用】</p>
    <p>(a)不得非法使用。被授权人不得以淫秽、诋毁性或其他非法形式或违反任何适用法规或行业规范的形式使用内容。</p>
    <p>(b)不得以独立文件形式使用。被授权人不能以任何允许其他人以独立文件的形式下载、提取或再分销内容的方式使用内容(即仅使用内容文件本身，与项目或最终用途相分离)。</p>
    <p>(c)不得对作者身份进行虚假陈述。被授权人不得虚假地声称被授权人是主要由授权内容组成的作品的原作者。例如，被授权人不能仅仅根据授权内容创作艺术品并声称自己是作者。</p>
    <p>(d)企业授权素材。未经事先批准，不得对企业图像作出授权。请联系能源图库以取得批准。</p>
    <p>3.【除被授权人之外，还有谁可以使用授权内容？】</p>
    <p>授予被授权人的权利不可转让或转授权，这意味着被授权人不能将这些权利转让或转授权给其他人，但是下类人士除外：</p>
    <p>授予被授权人的权利不可转让或转授权，这意味着被授权人不能将这些权利转让或转授权给其他人，但是下类人士除外：</p>
    <p>被授权人可以在权利和限制条款规定的用途必要或合适的范围内，授权他人使用被授权人作品和/或转让被授权人作品的所有权（不得包括其中包含的任何内容），使用被授权人作品或者购买被授权人作品所有权的用户或者第三人使用被授权人作品时无需为包含在被授权人作品中的内容单独付费，但不得被允许将内容以独立文件形式使用。</p>
    <p>4.用户账户。</p>
    <p>被授权人需要负责跟踪每个用户账户的所有活动，并且被授权人同意：(a)为所有密码和用户名保密；(b)出现任何未经授权使用或其他泄密事件后立即通知能源图库；以及(c)为每个用户账户项下发生的活动承担全部责任。能源图库保留监督下载和用户活动的权利，以确保遵守本协议的条款。如果能源图库认定被授权人违反了本条规定或本协议的任何其他条款，能源图库可以暂停被授权人账户的登录和寻求进一步的法律救济。</p>
    <p>5.知识产权。</p>
    <p>谁是内容的所有人？能源图库另有特别提示的以外，所有授权内容的知识产权均归能源图库或其内容提供者所有，能源图库及其内容提供者保留本协议中未明确授予的所有权利。</p>
    <p>6.终止/撤回</p>
    <p>(a)终止。如果被授权人违反本协议或与能源图库签订的任何其他协议的任何条款，能源图库可以在任何时候终止本协议，在此情况下，被授权人必须立即停止使用内容、删除或销毁任何复制件，以及一经要求，以书面形式向能源图库确认被授权人已遵守上述要求。</p>
    <p>(b)撤回内容。能源图库可以在任何时候自主决定终止任何内容的授权。如果能源图库通知或者被授权人获悉任何内容可能被指控侵犯任何第三方的权利，能源图库可以要求被授权人立即停止使用该内容、删除或销毁任何复制件以及确保被授权人的客户、雇主同样采取上述行动，因此引起的费用由被授权人自行承担。在符合本协议其他条款的前提下，能源图库将免费向被授权人提供替换内容（具体由能源图库根据其合理的商业判断确定）。
    </p>
    <p>7.声明和保证。能源图库声明和保证如下：</p>
    <p>用户明确同意其使用能源图库服务所存在的风险将完全由其自己承担；因其使用能源图库而产生的一切后果也由其自己承担，能源图库对用户不承担任何责任。</p>
    <p>用户明确同意其使用能源图库服务所存在的风险将完全由其自己承担；因其使用能源图库而产生的一切后果也由其自己承担，能源图库对用户不承担任何责任。</p>
    <p>能源图库不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由能源图库实际控制的任何网页上的内容，能源图库不承担任何责任。</p>
    <p>对于因不可抗力或能源图库不能控制的原因造成的网络服务中断或其它缺陷，能源图库不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
    <p>用户同意，对于能源图库向用户提供的产品或者服务的质量缺陷本身及其引发的任何损失，能源图库无需承担任何责任：</p>
    <p>无侵权保证。对于所有授权内容，能源图库保证，在被授权人依照本协议及双方另行签订的书面协议的规定和能源图库的交付格式使用内容的情况下（不包括被授权人对内容进行任何的修改、覆盖或焦距调整），不会侵犯内容所有人/创作者的任何著作权。</p>
    <p>有关保证的免责声明。除非以上明确保证的情形，能源图库未授予或提供与授权内容中描述或包含的名称、人物、商标、商业外观、标识或建筑（不论是否登记注册或获得著作权）有关的任何权利或保证。被授权人应自行负责确定被授权人对内容的拟使用是否需要获得许可，并应自行负责获得该等许可。能源图库未承诺和保证在使用含有人物肖像的授权内容时，是否不会被某些特定的行业协会要求支付额外的费用。被授权人应自行负责支付因被授权人使用授权内容而在任何适用的集体谈判协议项下应支付的任何款项，以及遵守该等协议的任何其他条款。/p>
    </p>
    <p>无其他保证。除本条中提供的保证外，内容均按现状提供，未附带任何类型的声明、保证或条件（不论明示或暗示），包括但不限于有关适销性或适合特定用途的暗示声明、保证或条件。能源图库未声明或保证内容或其网站符合被授权人的要求，或者内容或网站的使用不会发生中断或错误。
    </p>
    <p>8.赔偿/责任限制。</p>
    <p>(a)被授权人对能源图库的赔偿。被授权人同意赔偿能源图库因下列原因引起或与之相关的所有损害、赔偿责任和费用（包括合理的外部律师费），为能源图库和上述各方进行抗辩以及确保能源图库和上述各方免遭损害：(i)被授权人在本协议允许的范围之外使用内容；(ii)被授权人或代表被授权人行事的任何人违反或被指称违反本协议或与能源图库签订的任何其他协议的任何条款；(iii)被授权人未取得对于被授权人使用内容必要的任何许可。</p>
    <p>(b)能源图库对被授权人的赔偿。在被授权人未违反本协议或与能源图库签订的任何其他协议的情况下，作为提供给被授权人的、对于违反第8条项下的任何保证，能源图库同意依照本条规定，赔偿被授权人因能源图库违反或被指称违反第8条项下的任何保证引起或与之相关的所有损害、赔偿责任和费用（包括合理的外部律师费），为被授权人进行抗辩以及确保被授权人免遭损害。
    </p>
    <p>(c)要求赔偿方必须及时向另一方发出有关索赔的书面通知。赔偿方（承担费用的一方）有权采取任何索赔或诉讼的处理、和解或抗辩。受偿方（不承担费用的一方）必须以赔偿方合理要求的任何方式提供配合。赔偿方无需承担在另一方发出要求赔偿的索赔通知之前发生的律师费和其他费用。
    </p>
    <p>(d)责任限制。对于因本协议引起的任何利润损失、惩罚性、特殊、间接、后果性、附带或其他类似损害、费用或损失，能源图库无需对被授权人或任何其他人或实体承担责任，即便能源图库已被告知可能发生该等损害、费用或损失。</p>
    <p>9.一般性条款。</p>
    <p>(a)转让。本协议与被授权人签订，未经能源图库事先同意，被授权人不得转让本协议。能源图库可以将本协议转让给任何关联公司或权益承继人，无需事先通知或取得被授权人的同意，前提是该实体同意受本协议条款的约束。</p>
    <p>
      (b)电子存储。被授权人同意在储存及传送内容时保留版权符号、能源图库的名称、内容识别符和包含原始内容的电子文件中的任何其他信息或数据，以及采取合适的保密措施，防止未经授权的第三方使用内容。</p>
    <p>(c)适用法律/争议解决。 本协议应根据中华人民共和国法律解释、理解和管辖。双方之间就本协议产生的或与本协议有关的任何争议、争论或索赔，或本协议的违反、终止或无效应由双方友好协商解决。如果双方不能够在协商开始后三十(30)日内达成一致，则任何一方有权将事项提交能源图库住所地有管辖权的人民法院诉讼解决。</p>
    <p>(d)弃权。除非提供明确的书面弃权声明，否则不得将任何一方的任何行动理解为对本协议的任何条款的放弃。
    </p>
    <p>(e)完整协议。能源图库有权随时增加或删除本协议的任何条款或条件。本协议的条款与被授权人发出的任何购买订单、双方签订的其他书面协议中包含的条款之间存在任何冲突的，以具体购买订单、协议的条款为准；其他协议未涉及的，以本协议的条款为准。
    </p>
    <p>(f)通知。本协议项下要求发给能源图库的所有通知均应通过电子邮件发送至能源图库指定的邮箱。发给被授权人的所有通知将通过电子邮件发送至被授权人指定的电子邮箱。</p>
    <p>(g)税收。被授权人同意缴纳和承担因提供给被授权人的授权许可或被授权人使用授权内容而在任何司法管辖区被征收的任何及所有销售税、使用税、增值税、预扣税和关税。</p>
  </div>
</template>

<script>
/**
 *  footer-授权协议模块
 * @author lyh
 * @date 2020-12-30
 */
export default {
  name: 'Authorize'
}
</script>

<style scoped lang="scss">
.authorize{
  width: 100%;
  height: 100%;
  font-size: 16px;
  color: #333;
  line-height: 24px;
  box-shadow: 0 1px 4px 0 rgba(0, 0, 0, 0.2);
  padding: 24px;
  margin: 16px 0;
  h3{
    font-size: 20px;
    font-weight: bold;
    margin-bottom: 12px;
  }
  p{
    margin-bottom: 10px;
    text-align: justify;
  }
}
</style>
